// Монгол улсын иргэний бүртгэлийн дугаар болох регистрийн дугаар нь 10 оронтой эхний 2 орон нь үсэг үлдсэн нь тоо байдаг билээ. 
//Тэгвэл хэрвээ хэрэглэгч гараас 10 тэмдэгт оруулахад эхлээд тухайн оруулсан утганы урт нь 10 байгаа эсэх дараа нь эхний 2 орон 
//нь зөвхөн үсэг эсэх хамгийн эцэст нь үлдсэн 8 тэмдэгт нь бүхэлдээ тоо эсэхийг шалгана уу. Хэрвээ энэ бүх нөхцлүүд биелж байвал 
//та монгол улсын регистрийн дугаарыг зөв орууллаа гэж харуулна уу. Хэрвээ аль нэг нөхцөл нь буруу байвал та монгол улсын иргэний
// бүртгэлийн дугаарыг буруу орууллаа гэж харуулна уу.

let useg1='';
let useg2='';
let too=0;
let too1, too2, too3, too4, too5, too6,too7, too8;
const RD='';

if(too<=10){
    if(useg1='' && useg2=''){
        if(too1&&too2&&too3&&too4&&too5&&too6&too7&&too8==too){
            console.log('Ta mongol ulsiin irgen mun bn');
        }
        else{
            console.log('Ta mongol ulsiin irgen bish bn');
        }
    }
    
}
else{
    console.log('10-s deesh temdegt oruulsan bn');
}
